{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_3610","layers":[{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18046","trainable":true,"batch_input_shape":[null,19350],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18047","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18048","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18049","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18050","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.16.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense18046/kernel","shape":[19350,15],"dtype":"float32"},{"name":"dense_Dense18046/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18047/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18047/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18048/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18048/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18049/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18049/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18050/kernel","shape":[15,6],"dtype":"float32"},{"name":"dense_Dense18050/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.16.0","convertedBy":null}