{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2406","layers":[{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12026","trainable":true,"batch_input_shape":[null,16200],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12027","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12028","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12029","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12030","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.12.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense12026/kernel","shape":[16200,15],"dtype":"float32"},{"name":"dense_Dense12026/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12027/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12027/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12028/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12028/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12029/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12029/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12030/kernel","shape":[15,6],"dtype":"float32"},{"name":"dense_Dense12030/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.12.0","convertedBy":null}