{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_3602","layers":[{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18006","trainable":true,"batch_input_shape":[null,19350],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18007","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18008","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18009","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18010","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.16.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense18006/kernel","shape":[19350,15],"dtype":"float32"},{"name":"dense_Dense18006/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18007/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18007/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18008/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18008/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18009/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense18009/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense18010/kernel","shape":[15,6],"dtype":"float32"},{"name":"dense_Dense18010/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.16.0","convertedBy":null}