{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2401","layers":[{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12001","trainable":true,"batch_input_shape":[null,19350],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12002","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12003","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12004","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12005","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.12.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense12001/kernel","shape":[19350,15],"dtype":"float32"},{"name":"dense_Dense12001/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12002/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12002/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12003/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12003/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12004/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense12004/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense12005/kernel","shape":[15,6],"dtype":"float32"},{"name":"dense_Dense12005/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.12.0","convertedBy":null}